[
    {
        "Job ID": "280225019293",
        "Title": "Software Engineer",
        "Company": "Justdial",
        "Experience": "0-5 Yrs",
        "Location": "Mumbai",
        "Link": "https://www.naukri.com/job-listings-software-engineer-justdial-mumbai-0-to-5-years-280225019293",
        "Description": "Job Responsibilities:\n\nWe are looking for a Software Enginner who is proficient in writing clean, well-designed, and logical code. The ideal candidate will be capable of troubleshooting, testing, and maintaining core product software and databases to ensure optimal performance and functionality. You will be expected to contribute throughout all phases of the development cycle, from design to deployment.\n\n\n\n\nKey responsibilities:\n\n- Developing, testing, and maintaining software solutions.\n\n- Troubleshooting and debugging to ensure the functionality and performance of the core product.\n\n- Ensuring that code follows industry best practices.\n\n- Developing and deploying new features to enhance the software product.\n\n- Creating relevant tools and procedures as required for effective software development and maintenance.\n\n\n\n\nKey Skills:\n\n- Programming Languages: Proficiency in C and C++.\n\n- Logical Reasoning and Aptitude: Strong analytical skills and ability to solve complex problems.\n\n- Software Development Experience: 0-12 months of experience in Perl or Python programming.\n\n- Database Management: Expertise in MySQL.\n\n- Best Practices: Passion for best design and coding practices.\n\n- AI Technologies: Keen interest in leveraging AI technologies when applicable.\n\n\n\n\nQualifications:\n\n- Bachelors Degree in Engineering (BE), Master of Computer Applications (MCA), or Master of Science (MSc) in Computer Science.\n\n\n"
    },
    {
        "Job ID": "060125503214",
        "Title": "Software Engineer",
        "Company": "RBL FinServe",
        "Experience": "0-3 Yrs",
        "Location": "Mumbai",
        "Link": "https://www.naukri.com/job-listings-software-engineer-rbl-bank-ltd-mumbai-0-to-3-years-060125503214",
        "Description": "RBL Bank Ltd is looking for Software Engineer to join our dynamic team and embark on a rewarding career journey\nDeveloping and directing software system validation and testing methods.\nDirecting our software programming initiatives\nOverseeing the development of documentation.\nWorking closely with clients and cross-functional departments to communicate project statuses and proposals.\nAnalyzing data to effectively coordinate the installation of new systems or the modification of existing systems.\nManaging the software development lifecycle.\nMonitoring system performance.\nCommunicating key project data to team members and building cohesion among teams.\nDeveloping and executing project plans.\nApplying mathematics and statistics to problem-solving initiatives.\nApplying best practices and standard operating procedures.\nCreating innovative solutions to meet our companys technical needs.\nTesting new software and fixing bugs.\nShaping the future of our systems."
    },
    {
        "Job ID": "100524500130",
        "Title": "AI Software Engineer",
        "Company": "Godigi Infotech",
        "Experience": "0-1 Yrs",
        "Location": "Mumbai, New Delhi, Pune, Bengaluru",
        "Link": "https://www.naukri.com/job-listings-ai-software-engineer-godigi-infotech-mumbai-new-delhi-pune-bengaluru-0-to-1-years-100524500130",
        "Description": "We are on the lookout for a passionate Artificial Intelligence Engineer to be a part of our dynamic team.In this role, your curiosity and deep interest in AI, machine learning, and keeping pace with a rapidly evolving field will guide your path. You will delve into extensive data sets, identify patterns, and craft predictive algorithmic models, contributing to innovative projects.\nIf your a tech-savvy innovator with a drive to make a significant impact in the realm of AI, were eager for you to bring your talents to our team\n \nAI Engineer Responsibilities\nDesign and develop cutting-edge AI solutions and systems that integrate with our products and services\nCollaborate with cross-functional teams to assess business needs and identify opportunities for AI solutions\nImplement and maintain AI models, algorithms, and tools\nConduct research and experiments to improve the performance of AI systems\nDevelop and maintain documentation for AI models and algorithms\nMonitor the performance of AI systems and make recommendations for improvements\nStay up-to-date with advancements in AI technologies and make recommendations for future development\n\nAI Engineer Requirements and Skills\n\nBachelors degree in Computer Science, Engineering, or a related field\nExperience in developing and deploying AI solutions\nProven track record of designing and implementing complex machine learning algorithms and models\nStrong programming skills in Python, R, MATLAB, or other relevant programming language\nExperience working with large datasets and data pre-processing techniques\nStrong problem-solving and analytical skills\nExcellent communication and collaboration skills"
    }
]